# x, y, z = map(int, input().split())
# print(x,y,z)

# n, a, b = map(int, input().split())
# print(n * a * b * 2)
#
# input() возвращает строку (например: "1 2 3")
# split() преобразует строку в list по разделителю - по умолчанию это пробел (результат: ["1", "2" ,"3"])
# map преобразует список в соответствие с функцией - в данном случае int(elem) (результат: [1, 2 , 3]
y = ' ********* '
print('Гвидо%sВан%sРоссум%sTrening' %(5555555,'ttttttt', y), end='-')
print('Основатель', 'Питона', sep='_', end='!')